In [84]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [85]:
df1 = pd.read_csv('user_demographics.csv')
df2 = pd.read_csv('User_product_purchase_details_p2.csv')

In [86]:
df1.shape

(5891, 4)

In [87]:
df2.shape

(550068, 9)

In [88]:
df2[:5]

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase
0,1000001,P00069042,A,2,0,3,NaN,NaN,8370
1,1000001,P00248942,A,2,0,1,6.0,14.0,15200
2,1000001,P00087842,A,2,0,12,NaN,NaN,1422
3,1000001,P00085442,A,2,0,12,14.0,NaN,1057
4,1000002,P00285442,C,4+,0,8,NaN,NaN,7969

In [89]:
df1[:5]

   User_ID Gender    Age  Occupation
0  1000001      F   0-17          10
1  1000002      M    55+          16
2  1000003      M  26-35          15
3  1000004      M  46-50           7
4  1000005      M  26-35          20

In [90]:
ds = pd.merge(df2,df1,right_on='User_ID',left_on='User_ID')

In [91]:
ds[:5]

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender,Age,Occupation
0,1000001,P00069042,A,2,0,3,NaN,NaN,8370,F,0-17,10
1,1000001,P00248942,A,2,0,1,6.0,14.0,15200,F,0-17,10
2,1000001,P00087842,A,2,0,12,NaN,NaN,1422,F,0-17,10
3,1000001,P00085442,A,2,0,12,14.0,NaN,1057,F,0-17,10
4,1000002,P00285442,C,4+,0,8,NaN,NaN,7969,M,55+,16

In [92]:
df['Age']

4         55
5         30
6         48
7         48
8         48
          ..
550063    53
550064    30
550065    30
550066    55
550067    48
Name: Age, Length: 534966, dtype: int32

In [93]:
#spliting the age range into int(age)

ds['start']=ds['Age'].str.split('-').str[0]

ds['end']=ds['Age'].str.split('-').str[1]
 
#+ is present so replace

ds['start']=ds['start'].str.replace('+','',regex=False)
 
#for null val in end of range replace with start 

ds['end']=ds['end'].fillna(ds['start'])
 
#convert to int datatype

ds['start']=ds['start'].astype(int)

ds['end']=ds['end'].astype(int)
 
#finding median

ds['Age']=(ds['start']+ds['end'])/2

#drop the temp col

ds.drop(['start','end'],axis=1,inplace=True)

ds["Age"]=ds['Age'].astype(int)

In [94]:
ds.shape

(550068, 12)

In [95]:
ds.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 550068 entries, 0 to 550067
Data columns (total 12 columns):
 #   Column                      Non-Null Count   Dtype
---  ------                      --------------   -----
 0   User_ID                     550068 non-null  int64
 1   Product_ID                  550068 non-null  object
 2   City_Category               550068 non-null  object
 3   Stay_In_Current_City_Years  550068 non-null  object
 4   Marital_Status              550068 non-null  int64
 5   Product_Category_1          550068 non-null  int64
 6   Product_Category_2          376430 non-null  float64
 7   Product_Category_3          166821 non-null  float64
 8   Purchase                    550068 non-null  int64
 9   Gender                      550068 non-null  object
 10  Age                         550068 non-null  int32
 11  Occupation                  550068 non-null  int64
dtypes: float64(2), int32(1), int64(5), object(4)
memory usage: 48.3+ MB

In [96]:
ds['Stay_In_Current_City_Years'] = ds['Stay_In_Current_City_Years'].str.rstrip('+')

In [97]:
ds['Stay_In_Current_City_Years'] = ds['Stay_In_Current_City_Years'].astype(int)

In [98]:
ds['Product_Category_2'] = ds['Product_Category_2'].fillna(0)

In [99]:
ds['Product_Category_2'] = ds['Product_Category_2'].astype(int)

In [100]:
ds['Product_Category_3'] = ds['Product_Category_3'].fillna(0)

In [101]:
ds['Product_Category_3'] = ds['Product_Category_3'].astype(int)

In [102]:
ds = ds.drop(ds[ds['Age']<18].index)

In [103]:
ds['Product_Category'] = ds[['Product_Category_1','Product_Category_2','Product_Category_3']].sum(axis=1)

In [104]:
ds[:5]

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Product_Category_1,Product_Category_2,Product_Category_3,Purchase,Gender,Age,Occupation,Product_Category
4,1000002,P00285442,C,4,0,8,0,0,7969,M,55,16,8
5,1000003,P00193542,A,3,0,1,2,0,15227,M,30,15,3
6,1000004,P00184942,B,2,1,1,8,17,19215,M,48,7,26
7,1000004,P00346142,B,2,1,1,15,0,15854,M,48,7,16
8,1000004,P0097242,B,2,1,1,16,0,15686,M,48,7,17

In [105]:
ds = ds.drop(ds[['Product_Category_1','Product_Category_2','Product_Category_3']],axis=1)

In [106]:
ds

,User_ID,Product_ID,City_Category,Stay_In_Current_City_Years,Marital_Status,Purchase,Gender,Age,Occupation,Product_Category
4,1000002,P00285442,C,4,0,7969,M,55,16,8
5,1000003,P00193542,A,3,0,15227,M,30,15,3
6,1000004,P00184942,B,2,1,19215,M,48,7,26
7,1000004,P00346142,B,2,1,15854,M,48,7,16
8,1000004,P0097242,B,2,1,15686,M,48,7,17
...,...,...,...,...,...,...,...,...,...,...
550063,1006033,P00372445,B,1,1,368,M,53,13,20
550064,1006035,P00375436,C,3,0,371,F,30,1,20
550065,1006036,P00375436,B,4,1,137,F,30,15,20
550066,1006038,P00375436,C,2,0,365,F,55,1,20
550067,1006039,P00371644,B,4,1,490,F,48,0,20

In [107]:
df = ds.drop(ds[['City_Category','Product_ID','Gender','Marital_Status']],axis=1)

In [108]:
dj = df

In [109]:
dj

,User_ID,Stay_In_Current_City_Years,Purchase,Age,Occupation,Product_Category
4,1000002,4,7969,55,16,8
5,1000003,3,15227,30,15,3
6,1000004,2,19215,48,7,26
7,1000004,2,15854,48,7,16
8,1000004,2,15686,48,7,17
...,...,...,...,...,...,...
550063,1006033,1,368,53,13,20
550064,1006035,3,371,30,1,20
550065,1006036,4,137,30,15,20
550066,1006038,2,365,55,1,20
550067,1006039,4,490,48,0,20

In [110]:
df[:5]

,User_ID,Stay_In_Current_City_Years,Purchase,Age,Occupation,Product_Category
4,1000002,4,7969,55,16,8
5,1000003,3,15227,30,15,3
6,1000004,2,19215,48,7,26
7,1000004,2,15854,48,7,16
8,1000004,2,15686,48,7,17

In [111]:
mean=dj['Purchase'].mean()
def voucher(purchase):
    if purchase > mean:
         dis=purchase*0.25
         return purchase-dis
    else:
        return purchase
dj['After_discount']=dj['Purchase'].apply(voucher)

In [112]:
dj[:5]

,User_ID,Stay_In_Current_City_Years,Purchase,Age,Occupation,Product_Category,After_discount
4,1000002,4,7969,55,16,8,7969.00
5,1000003,3,15227,30,15,3,11420.25
6,1000004,2,19215,48,7,26,14411.25
7,1000004,2,15854,48,7,16,11890.50
8,1000004,2,15686,48,7,17,11764.50

In [113]:
dj = dj.groupby('User_ID').agg({
    'Stay_In_Current_City_Years': 'first',
    'Purchase': 'sum',
    'Age': 'first',
    'Occupation': 'first',
    'Product_Category': 'sum',
    'After_discount': 'sum'
}).reset_index()

In [114]:
dj.reset_index()

,index,User_ID,Stay_In_Current_City_Years,Purchase,Age,Occupation,Product_Category,After_discount
0,0,1000002,4,810472,55,16,1252,661163.00
1,1,1000003,3,341635,30,15,358,277406.00
2,2,1000004,2,206468,48,7,262,155933.50
3,3,1000005,1,821001,30,20,1508,731065.50
4,4,1000006,1,379930,53,9,874,320093.00
...,...,...,...,...,...,...,...,...
5668,5668,1006036,4,4116058,30,15,8112,3643821.75
5669,5669,1006037,4,1119538,48,1,2288,950006.75
5670,5670,1006038,2,90034,55,1,227,80861.50
5671,5671,1006039,4,590319,48,0,1343,510367.00
5672,5672,1006040,2,1653299,30,6,2706,1398981.75

In [115]:
x = dj.iloc[:,[1,3,4]]

In [116]:
y = dj.iloc[:,2]

In [126]:
from sklearn.model_selection import train_test_split
from sklearn.ensemble import RandomForestRegressor
from sklearn.metrics import r2_score,mean_squared_error,accuracy_score,precision_score, mean_absolute_error

In [118]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y,test_size=0.2,random_state=42)

In [119]:
xtrain[:5]

      Stay_In_Current_City_Years  Age  Occupation
4967                           0   21           4
1071                           0   30          12
718                            3   30           7
5308                           1   53           1
670                            4   30          18

In [120]:
ytrain[:5]

4967     208790
1071    1186426
718      203258
5308    1279586
670      847538
Name: Purchase, dtype: int64

In [121]:
xtrain.shape

(4538, 3)

In [134]:
R = RandomForestRegressor()

In [135]:
model1 = R.fit(xtrain,ytrain)

In [136]:
Pred1 = model.predict(xtest)

In [137]:
error1 = mean_absolute_error(ytest,Pred)

In [138]:
error1

686936.3925182202

In [139]:
r2_score(ytest,Pred1)

-0.10982499400578072

In [133]:
from sklearn.svm import SVR
regressor = SVR(kernel='rbf')

In [141]:
model2 = regressor.fit(xtrain,ytrain)

In [142]:
Pred2 = model1.predict(xtest)

In [143]:
mean_absolute_error(ytest,Pred2)

584855.1207914123

In [144]:
r2_score(ytest,Pred2)

-0.141152516519212

In [145]:
from sklearn.tree import DecisionTreeRegressor

In [147]:
dt = DecisionTreeRegressor(min_samples_leaf=5,min_samples_split=5,max_depth=10,max_features=5,random_state=42)

In [148]:
model3 = dt.fit(xtrain,ytrain)

In [149]:
Pred3 = model3.predict(xtest)

In [150]:
mean_absolute_error(ytest,Pred3)

669446.830040919

In [151]:
r2_score(ytest,Pred3)

-0.059948088997879845